-- Criação da tabela empregados
CREATE TABLE empregados (
    id INT PRIMARY KEY,
    nome VARCHAR(50) NOT NULL,
    cargo VARCHAR(50) NOT NULL,
    ordenado DECIMAL(8,2) NOT NULL,
    telefone BIGINT NULL,
    email VARCHAR(100) NULL,
    ativo TINYINT(1) NOT NULL
);

-- Inserção dos dados
INSERT INTO empregados (id, nome, cargo, ordenado, telefone, email, ativo) VALUES 
(1, 'Bruno', 'Empregado', 750.00, 916666666, 'bruno@empresaxpto.com', 1),
(2, 'Marco', 'Gestor', 1200.00, 964444444, 'marco@hotmail.com', 0),
(3, 'Tiago', 'CEO', 2400.00, 96, 'tiago@empresaxpto.com', 1),
(4, 'Maria', 'Consultora', 699.99, NULL, NULL, 1),
(5, 'Joaquim', 'Vendedor', 700.00, NULL, 'joaquim@live.com', 1),
(6, 'Joana', 'Empregado', 999.00, 256888888, 'joana@outlook.com', 1);

In [9]:
# Conexão com o MySQL
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host='localhost',        # ou IP do servidor MySQL
    user='root',      # substitui pelo teu user do MySQL
    password='',    # substitui pela tua senha
    database='empregados'       # substitui pelo nome da base onde está a tabela empregados
)

print("Conexão estabelecida com sucesso!")

Conexão estabelecida com sucesso!

## a) Quais são os empregados registados na base de dados?

Nesta questão queremos visualizar **todas as informações** da tabela `empregados`. 
O objetivo é praticar consultas básicas com `SELECT *`.

In [10]:
query_a = "SELECT * FROM empregados;"
df_a = pd.read_sql(query_a, conn)
df_a

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\48655898.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_a = pd.read_sql(query_a, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22
1,2,Marco,Gestor,1320.00,964444444,marco@hotmail.com,1,2025-07-25 22:23:22
2,3,Tiago,CEO,3300.00,96,tiago@empresaxpto.com,1,2025-07-25 22:23:22
3,4,Maria,Consultora,769.99,None,None,1,2025-07-25 22:23:22
4,6,Joana,Empregado,1199.99,256888888,joana@outlook.com,1,2025-07-25 22:23:22
5,8,Sérgio,Estagiario,902.00,None,None,1,2025-07-26 14:40:40

## b) Quais os nomes dos empregados?

Nesta questão queremos visualizar apenas o **atributo nome** da tabela `empregados`.  
O objetivo é praticar consultas com `SELECT` específico e filtrar colunas.

In [11]:
query_b = "SELECT nome FROM empregados;"
df_b = pd.read_sql(query_b, conn)
df_b

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\1436544507.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_b = pd.read_sql(query_b, conn)

     nome
0   Bruno
1   Marco
2   Tiago
3   Maria
4   Joana
5  Sérgio

## c) Quais são os contactos dos empregados?
Visualizar **nome, telefone e email**.

In [12]:
query_c = "SELECT nome, telefone, email FROM empregados;"
df_c = pd.read_sql(query_c, conn)
df_c

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\1484179300.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_c = pd.read_sql(query_c, conn)

     nome   telefone                  email
0   Bruno  916666666  bruno@empresaxpto.com
1   Marco  964444444      marco@hotmail.com
2   Tiago         96  tiago@empresaxpto.com
3   Maria       None                   None
4   Joana  256888888      joana@outlook.com
5  Sérgio       None                   None

## d) Quais os empregados com cargo "Empregado"?
Filtrar pelo cargo específico.

In [13]:
query_d = "SELECT * FROM empregados WHERE cargo = 'Empregado';"
df_d = pd.read_sql(query_d, conn)
df_d

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\1825432038.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_d = pd.read_sql(query_d, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22
1,6,Joana,Empregado,1199.99,256888888,joana@outlook.com,1,2025-07-25 22:23:22

## e) Quais os empregados com ordenado superior a 700?
Filtrar pelo salário maior que 700.

In [14]:
query_e = "SELECT * FROM empregados WHERE ordenado > 700;"
df_e = pd.read_sql(query_e, conn)
df_e

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\3845223908.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_e = pd.read_sql(query_e, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22
1,2,Marco,Gestor,1320.00,964444444,marco@hotmail.com,1,2025-07-25 22:23:22
2,3,Tiago,CEO,3300.00,96,tiago@empresaxpto.com,1,2025-07-25 22:23:22
3,4,Maria,Consultora,769.99,None,None,1,2025-07-25 22:23:22
4,6,Joana,Empregado,1199.99,256888888,joana@outlook.com,1,2025-07-25 22:23:22
5,8,Sérgio,Estagiario,902.00,None,None,1,2025-07-26 14:40:40

## f) Quem tem ordenado entre 1000 e 1500€?
Filtrar por intervalo de salário.

In [15]:
query_f = "SELECT * FROM empregados WHERE ordenado BETWEEN 1000 AND 1500;"
df_f = pd.read_sql(query_f, conn)
df_f

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\2043771056.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_f = pd.read_sql(query_f, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22
1,2,Marco,Gestor,1320.00,964444444,marco@hotmail.com,1,2025-07-25 22:23:22
2,6,Joana,Empregado,1199.99,256888888,joana@outlook.com,1,2025-07-25 22:23:22

## g) Quais são os ordenados dos empregados ativos?
Filtrar apenas os ativos.

In [16]:
query_g = "SELECT ordenado FROM empregados WHERE ativo = 1;"
df_g = pd.read_sql(query_g, conn)
df_g

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\497244928.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_g = pd.read_sql(query_g, conn)

   ordenado
0   1199.99
1   1320.00
2   3300.00
3    769.99
4   1199.99
5    902.00

## h) Quais são os empregados com e-mail?
Filtrar onde o campo email **não é NULL**.

In [17]:
query_h = "SELECT * FROM empregados WHERE email IS NOT NULL;"
df_h = pd.read_sql(query_h, conn)
df_h

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\1373602759.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_h = pd.read_sql(query_h, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22
1,2,Marco,Gestor,1320.00,964444444,marco@hotmail.com,1,2025-07-25 22:23:22
2,3,Tiago,CEO,3300.00,96,tiago@empresaxpto.com,1,2025-07-25 22:23:22
3,6,Joana,Empregado,1199.99,256888888,joana@outlook.com,1,2025-07-25 22:23:22

## i) Quais os empregados com telemóvel da Vodafone?
Assumindo que Vodafone começa com 96 ou 91.

In [18]:
query_i = "SELECT * FROM empregados WHERE telefone LIKE '96%' OR telefone LIKE '91%';"
df_i = pd.read_sql(query_i, conn)
df_i

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\3387746504.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_i = pd.read_sql(query_i, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22
1,2,Marco,Gestor,1320.00,964444444,marco@hotmail.com,1,2025-07-25 22:23:22
2,3,Tiago,CEO,3300.00,96,tiago@empresaxpto.com,1,2025-07-25 22:23:22

## j) Quais os empregados com e-mail da firma (yyyy@empresaxpto.com)?
Filtrar emails que terminam com @empresaxpto.com

In [19]:
query_j = "SELECT * FROM empregados WHERE email LIKE '%@empresaxpto.com';"
df_j = pd.read_sql(query_j, conn)
df_j

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\91454798.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_j = pd.read_sql(query_j, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22
1,3,Tiago,CEO,3300.00,96,tiago@empresaxpto.com,1,2025-07-25 22:23:22

## k) Quais são os empregados, ordenados pelo campo nome crescente?
Mostrar toda a informação ordenada por nome (ASC).

In [20]:
query_k = "SELECT * FROM empregados ORDER BY nome ASC;"
df_k = pd.read_sql(query_k, conn)
df_k

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\2701250712.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_k = pd.read_sql(query_k, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22
1,6,Joana,Empregado,1199.99,256888888,joana@outlook.com,1,2025-07-25 22:23:22
2,2,Marco,Gestor,1320.00,964444444,marco@hotmail.com,1,2025-07-25 22:23:22
3,4,Maria,Consultora,769.99,None,None,1,2025-07-25 22:23:22
4,8,Sérgio,Estagiario,902.00,None,None,1,2025-07-26 14:40:40
5,3,Tiago,CEO,3300.00,96,tiago@empresaxpto.com,1,2025-07-25 22:23:22

## l) Quais são os empregados, ordenados pelo campo nome decrescente?
Mostrar toda a informação ordenada por nome (DESC).

In [21]:
query_l = "SELECT * FROM empregados ORDER BY nome DESC;"
df_l = pd.read_sql(query_l, conn)
df_l

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\2070317981.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_l = pd.read_sql(query_l, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,3,Tiago,CEO,3300.00,96,tiago@empresaxpto.com,1,2025-07-25 22:23:22
1,8,Sérgio,Estagiario,902.00,None,None,1,2025-07-26 14:40:40
2,4,Maria,Consultora,769.99,None,None,1,2025-07-25 22:23:22
3,2,Marco,Gestor,1320.00,964444444,marco@hotmail.com,1,2025-07-25 22:23:22
4,6,Joana,Empregado,1199.99,256888888,joana@outlook.com,1,2025-07-25 22:23:22
5,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22

## m) Quais são os empregados, ordenados pelo cargo crescente e ordenado decrescente?
Mostrar cargo, ordenado e nome.

In [22]:
query_m = "SELECT cargo, ordenado, nome FROM empregados ORDER BY cargo ASC, ordenado DESC;"
df_m = pd.read_sql(query_m, conn)
df_m

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\1399121367.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_m = pd.read_sql(query_m, conn)

        cargo  ordenado    nome
0         CEO   3300.00   Tiago
1  Consultora    769.99   Maria
2   Empregado   1199.99   Bruno
3   Empregado   1199.99   Joana
4  Estagiario    902.00  Sérgio
5      Gestor   1320.00   Marco

## n) Quantos empregados?
Contar o total de empregados.

In [23]:
query_n = "SELECT COUNT(*) AS total_empregados FROM empregados;"
df_n = pd.read_sql(query_n, conn)
df_n

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\1515112084.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_n = pd.read_sql(query_n, conn)

   total_empregados
0                 6

## o) Quantos empregados têm e-mail?
Contar onde email não é NULL.

In [24]:
query_o = "SELECT COUNT(*) AS total_com_email FROM empregados WHERE email IS NOT NULL;"
df_o = pd.read_sql(query_o, conn)
df_o

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\3794623808.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_o = pd.read_sql(query_o, conn)

   total_com_email
0                4

## p) Valor total dos honorários de todos os empregados
Soma de todos os salários.

In [25]:
query_p = "SELECT SUM(ordenado) AS total_honorarios FROM empregados;"
df_p = pd.read_sql(query_p, conn)
df_p

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\3639086355.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_p = pd.read_sql(query_p, conn)

   total_honorarios
0           8691.97

## q) Valor total dos honorários exceto o CEO

In [26]:
query_q = "SELECT SUM(ordenado) AS total_sem_ceo FROM empregados WHERE cargo != 'CEO';"
df_q = pd.read_sql(query_q, conn)
df_q

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\4285413851.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_q = pd.read_sql(query_q, conn)

   total_sem_ceo
0        5391.97

## r) Média dos ordenados

In [27]:
query_r = "SELECT AVG(ordenado) AS media_ordenado FROM empregados;"
df_r = pd.read_sql(query_r, conn)
df_r

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\594868189.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_r = pd.read_sql(query_r, conn)

   media_ordenado
0     1448.661667

## s) Quais os vários cargos disponíveis?

In [28]:
query_s = "SELECT DISTINCT cargo FROM empregados;"
df_s = pd.read_sql(query_s, conn)
df_s

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\3217690752.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_s = pd.read_sql(query_s, conn)

        cargo
0   Empregado
1      Gestor
2         CEO
3  Consultora
4  Estagiario

## t) Quem recebe o ordenado mais baixo?

In [29]:
query_t = "SELECT * FROM empregados ORDER BY ordenado ASC LIMIT 1;"
df_t = pd.read_sql(query_t, conn)
df_t

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\3055824175.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_t = pd.read_sql(query_t, conn)

   id   nome       cargo  ordenado telefone email  ativo       data_insercao
0   4  Maria  Consultora    769.99     None  None      1 2025-07-25 22:23:22

## u) Quem recebe o maior ordenado? Qual o valor?

In [30]:
query_u = "SELECT * FROM empregados ORDER BY ordenado DESC LIMIT 1;"
df_u = pd.read_sql(query_u, conn)
df_u

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\3759000776.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_u = pd.read_sql(query_u, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,3,Tiago,CEO,3300.0,96,tiago@empresaxpto.com,1,2025-07-25 22:23:22

## v) Quais são os três ordenados mais baixos?

In [31]:
query_v = "SELECT * FROM empregados ORDER BY ordenado ASC LIMIT 3;"
df_v = pd.read_sql(query_v, conn)
df_v

C:\Users\HP\AppData\Local\Temp\ipykernel_13208\2881198972.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_v = pd.read_sql(query_v, conn)

,id,nome,cargo,ordenado,telefone,email,ativo,data_insercao
0,4,Maria,Consultora,769.99,None,None,1,2025-07-25 22:23:22
1,8,Sérgio,Estagiario,902.00,None,None,1,2025-07-26 14:40:40
2,1,Bruno,Empregado,1199.99,916666666,bruno@empresaxpto.com,1,2025-07-25 22:23:22